
"""
正则规则:
    \num        代表 引用第几组的内容.

    扩展:
        (?P<分组名>)   设置分组
        (?P=分组名)    使用分组

------------------------------------------------------------------

案例: 演示正则表达式之 查找正确的HTML标签对

参考的html代码:
    <html>
        <head></head>       # 开始, 开放标签,    结束, 闭合标签.
        <body></body>
        <br />              # 自闭合标签.
    </html>
"""
import re


# # 需求1: 校验html的单级标签.
# # 1.定义变量, 记录: html标签.
# html_s = '<html>我是html页面</html>'        # 字母数: 1 ~ 4

# 2.匹配校验.
# 写法1: 重新copy一份.
# my_reg = r'<[a-zA-Z]{1,4}>.*</[a-zA-Z0-9]{1,4}>'
# 写法2: 引入分组的概念.
# \num num 组号 (引用/复制第几组的规则内容)
# my_reg =  r'<([a-zA-Z]{1,4})>.*</\1>'

# 3.打印结果.
# if re.search(my_reg, html_s):
#     print('匹配成功', html_s)
# else:
#     print('匹配失败')

# 需求2: 校验html的单级标签.
# 1.定义变量, 记录: html标签.
html_s = '<html><h1>我是html页面</h1></html>'  # 字母数: 1 ~ 4,  标题标签1 ~ 6

# 2.匹配校验.
# 写法1: 重新copy一份.
# my_reg = r'<[a-zA-Z]{1,4}><h[1-6]>.*</h[1,6]></[a-zA-Z]{1,4}>'

# 写法2: 引入分组的概念.
# my_reg = r'<([a-zA-Z]{1,4})><(h[1-6])>.*</\2></\1>'

# 写法3(扩展): 给分组起名.
my_reg = r'<(?P<my_a1>[a-zA-Z]{1,4})><(?P<my_h>h[1-6])>.*</(?P=my_h)></(?P=my_a1)>)>'

# 3.打印结果.
result = re.match(my_reg, html_s)
if result:
    print('匹配成功：', html_s)
else:
    print('匹配失败')

